read_verilog sha256_unrolled_pipelined.v
synth_xilinx -top overall
write_verilog sha256_unrolled_pipelined_synth.v